Autodesk.Navisworks.Api.Schema.FieldCollection
A collection of Fields.

Autodesk.Navisworks.Api.Schema.FieldCollection.#ctor
Create an empty collection.

Autodesk.Navisworks.Api.Schema.FieldCollection.#ctor(Autodesk.Navisworks.Api.Schema.FieldCollection)
Create one collection from another.
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.Schema.FieldCollection.Add(Autodesk.Navisworks.Api.Schema.Field)
Adds item to the end of the collection.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#Add(System.Object)
Adds an item to the System.Collections.IList.
value:
The System.Object to add to the System.Collections.IList.
Returns:
The position into which the new element was inserted.
Throws System.NotSupportedException:
The System.Collections.IList is read-only.-or- The System.Collections.IList has a fixed size.

Autodesk.Navisworks.Api.Schema.FieldCollection.AddRange(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.Schema.Field})
Add the items of the specified collection to the SavedItemCollection
from: The collection to add items from

Autodesk.Navisworks.Api.Schema.FieldCollection.Clear
Removes all items from the collection
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#Generic#ICollection{T}#IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.FieldCollection.Contains(Autodesk.Navisworks.Api.Schema.Field)
Determines whether the SavedItemCollection contains a specific value.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#Contains(System.Object)
Determines whether the System.Collections.IList contains a specific value.
value:
The System.Object to locate in the System.Collections.IList.
Returns:
true if the System.Object is found in the System.Collections.IList; otherwise, false.

Autodesk.Navisworks.Api.Schema.FieldCollection.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.Schema.Field})
Sets the contents of the collection to the items in from
from: The collection to copy contents from

Autodesk.Navisworks.Api.Schema.FieldCollection.CopyTo(Autodesk.Navisworks.Api.Schema.Field[],System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentException: array is multidimensional.-or-arrayIndex is equal to or greater than the length of array.-or-The number of elements in the source  is greater than the available space from arrayIndex to the end of the destination array.-or-Type T cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#ICollection#CopyTo(System.Array,System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
index: The zero-based index in array at which copying begins.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentOutOfRangeException: index is less than zero.
Throws System.ArgumentException: array is multidimensional.-or- index is equal to or greater than the length of array.-or- The number of elements in the source  is greater than the available space from index to the end of the destination array.
Throws System.InvalidCastException: The type of the source  cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.Schema.FieldCollection.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.Schema.Field})
Enumerates over the collection and copies the items into to
to: Collection to copy into

Autodesk.Navisworks.Api.Schema.FieldCollection.Count
Gets the number of elements contained in the collection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.FieldCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#Item(System.Int32)
Gets or sets the element at the specified index.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.Schema.FieldCollection.IndexOf(Autodesk.Navisworks.Api.Schema.Field)
Determines the index of a specific item in the Collection
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#IndexOf(System.Object)
Determines the index of a specific item in the System.Collections.IList.
value:
The System.Object to locate in the System.Collections.IList.
Returns:
The index of value if found in the list; otherwise, -1.

Autodesk.Navisworks.Api.Schema.FieldCollection.Insert(System.Int32,Autodesk.Navisworks.Api.Schema.Field)
Inserts item into the collection at the specified index
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#Insert(System.Int32,System.Object)
Inserts an item to the  at the specified index.
value: The  to insert into the .
index: The zero-based index at which value should be inserted.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .
Throws System.NotSupportedException: The  is read-only.-or- The  has a fixed size.
Throws System.NullReferenceException: value is null reference in the .

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that
can be used to iterate through the collection.

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#IsFixedSize
Gets a value indicating whether the System.Collections.IList has a fixed size.
Returns:
true if the System.Collections.IList has a fixed size; otherwise, false.

Autodesk.Navisworks.Api.Schema.FieldCollection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#ICollection#IsSynchronized
Gets a value indicating whether access to the System.Collections.ICollection is synchronized (thread safe).
Returns:
true if access to the System.Collections.ICollection is synchronized (thread safe); otherwise, false.

Autodesk.Navisworks.Api.Schema.FieldCollection.Item(System.Int32)


Autodesk.Navisworks.Api.Schema.FieldCollection.Remove(Autodesk.Navisworks.Api.Schema.Field)
Removes the first occurrence of a specific item from the collection.
item: The object to remove from the collection.
Returns: true if item was successfully removed from the collection; otherwise, false.
This method also returns false if item is not found in the original collection.
Throws System.NotSupportedException: The collection is read-only.
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#IList#Remove(System.Object)
Removes the first occurrence of a specific object from the .
value: The  to remove from the .
Throws System.NotSupportedException: The  is read-only.-or- The  has a fixed size.

Autodesk.Navisworks.Api.Schema.FieldCollection.RemoveAt(System.Int32)
Removes the  item at the specified index.
index: The zero-based index of the item to remove.
Throws System.NotSupportedException: The  is read-only.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .

Autodesk.Navisworks.Api.Schema.FieldCollection.System#Collections#ICollection#SyncRoot
Gets an object that can be used to synchronize access to the System.Collections.ICollection.
Returns:
An object that can be used to synchronize access to the System.Collections.ICollection.